-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2017-04-28 09:43:49
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `tophrm`
--

-- --------------------------------------------------------

--
-- 表的结构 `tbl_employee`
--

CREATE TABLE IF NOT EXISTS `tbl_employee` (
  `employee_name` char(10) NOT NULL COMMENT '//姓名',
  `sex` char(2) NOT NULL COMMENT '//性别',
  `birthday` date NOT NULL COMMENT '//出生日期',
  `hometown` char(10) NOT NULL COMMENT '//籍贯',
  `marry` char(5) NOT NULL COMMENT '//婚姻状况',
  `person_num` char(18) NOT NULL COMMENT '//身份证号码',
  `address` char(50) NOT NULL COMMENT '//现居住地',
  `telphone` char(11) NOT NULL COMMENT '//手机号码',
  `wechat` char(20) DEFAULT NULL COMMENT '//微信号',
  `email` varchar(50) DEFAULT NULL COMMENT '//电子邮箱',
  `degree` char(10) NOT NULL COMMENT '//学历',
  `major` char(20) DEFAULT NULL COMMENT '//专业',
  `university` char(20) DEFAULT NULL COMMENT '//毕业大学',
  `graduate_school` char(20) DEFAULT NULL COMMENT '//研究生院',
  `skill` char(20) DEFAULT NULL COMMENT '//技能职称证书',
  `employee_ID` varchar(8) NOT NULL COMMENT '//员工编号',
  `place` char(10) NOT NULL COMMENT '//工作地点',
  `company` char(10) NOT NULL COMMENT '//所属公司',
  `department_one` char(10) NOT NULL COMMENT '//一级部门',
  `department_two` char(10) NOT NULL COMMENT '//二级部门',
  `department_three` char(10) NOT NULL COMMENT '//三级部门',
  `department_four` char(10) DEFAULT NULL COMMENT '//四级部门',
  `join_date` date NOT NULL COMMENT '//入职日期',
  `job_degree` char(3) NOT NULL COMMENT '//职等',
  `job_name` char(10) NOT NULL COMMENT '//职称',
  `job_content` char(200) DEFAULT NULL COMMENT '//职务',
  `job_status` char(5) NOT NULL COMMENT '//在职状况',
  `contract_type` char(10) NOT NULL COMMENT '//合同类型',
  `contract_company` char(20) NOT NULL COMMENT '//签约公司',
  `contract_start` date NOT NULL COMMENT '//合同开始日',
  `contract_end` date NOT NULL COMMENT '//合同结束日',
  `bank` char(20) DEFAULT NULL COMMENT '//开户银行',
  `bank_card` char(20) DEFAULT NULL COMMENT '//银行卡号',
  `reserve_num` char(20) DEFAULT NULL COMMENT '//公积金账号',
  `others` char(200) DEFAULT NULL COMMENT '//备注',
  `change_date` date NOT NULL COMMENT '//最后修改时间',
  PRIMARY KEY (`employee_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tbl_employee`
--

INSERT INTO `tbl_employee` (`employee_name`, `sex`, `birthday`, `hometown`, `marry`, `person_num`, `address`, `telphone`, `wechat`, `email`, `degree`, `major`, `university`, `graduate_school`, `skill`, `employee_ID`, `place`, `company`, `department_one`, `department_two`, `department_three`, `department_four`, `join_date`, `job_degree`, `job_name`, `job_content`, `job_status`, `contract_type`, `contract_company`, `contract_start`, `contract_end`, `bank`, `bank_card`, `reserve_num`, `others`, `change_date`) VALUES
('王娟', '女', '1984-06-22', '上海', '已婚', '310104198406223643', '上海市', '13764502586', 'bosia620', 'bosia_wang@126.com', '大学本科', '艺术设计', '东华大学', '', '', '00000658', '上海', '上海总部', '一级部门', '大数据中心', '二级部门', '', '2017-01-04', '3', '专员', '品类管理', '转正', '正式合同', '沈阳脱普上海分公司', '2017-01-04', '2020-06-30', '广大银行', '6226620604199455', '084249043205', '', '2017-04-28'),
('芦萌萌', '女', '1989-11-12', '山东', '单身', '370126198911127547', '', '18701973849', 'RSRZRCJMM', 'mengmeng__lu@163.com', '大学专科', '商务英语（中美合作）', '上海海事大学', '', '', '00000659', '上海', '上海总部', '一级部门', '电商事业部', '三级部门', '', '2017-02-06', '1', '助理', '电商运营', '试用', '派遣合同', '前程无忧', '2017-02-06', '2020-06-30', '光大银行', '', '159050042205', '', '2017-02-06'),
('马烨琳', '女', '1994-08-02', '浙江', '单身', '330683199408023224', '', '18702139581', 'youzi_alin', 'yelin099@163.com', '大学本科', '工业设计', '上海大学', '', '', '00000660', '上海', '上海总部', '一级部门', '研发一部', '三级部门', '', '2017-02-06', '1', '助理', '产品开发', '试用', '派遣合同', '前程无忧', '2017-02-06', '2020-06-30', '招商银行', '6214832140645552', '', '', '2017-02-06'),
('李慧玲', '女', '1993-05-14', '上海', '单身', '320582199305145145', '上海市', '13764993131', 'clear_6', '', '大学本科', '护理学', '上海中医药大学', '', '', '00000661', '上海', '上海总部', '一级部门', '采购二部', '三级部门', '', '2017-02-06', '1', '助理', '采购助理', '转正', '派遣合同', '前程无忧', '2017-02-06', '2020-06-30', '招商银行', '6214832132727525', '182053337205', '', '2017-04-28'),
('陈思巧', '女', '1995-06-30', '浙江', '单身', '330782199506303528', '', '15257963007', 'CSQCSQ0630', '605028788@qq.com', '大学本科', '市场营销', '河南理工大学', '', '', '00000662', '上海', '上海总部', '一级部门', '电商事业部', '三级部门', '', '2017-02-08', '1', '助理', '电商运营实习生', '实习', '派遣合同', '前程无忧', '2017-02-08', '2017-06-30', '招商银行', '6214835792961177', '', '实习生', '2017-02-08'),
('陈莹', '女', '1990-02-22', '吉林', '单身', '220822199002220028', '', '15216777721', '15216777721', '651689099@qq.com', '大学本科', '高分子材料与工程', '华东理工大学', '', '', '00000663', '上海', '上海总部', '一级部门', '洗护事业部', '三级部门', '', '2017-02-22', '1', '助理', '产品企划', '试用', '派遣合同', '前程无忧', '2017-02-22', '2020-06-30', '招商银行', '6214832142514392', '142896238205', '试用期：5500，转正：6000', '2017-02-22'),
('马梦笛', '女', '1991-10-25', '河南', '单身', '411303199110250021', '', '18801768823', 'sakuralz', 'nymmd123@sina.com', '大学专科', '会展策划与管理', '上海行健职业学院', '', '', '00000664', '上海', '上海总部', '一级部门', '电商事业部', '三级部门', '', '2017-03-06', '1', '助理', '产品企划', '试用', '派遣合同', '前程无忧', '2017-03-06', '2020-06-30', '光大银行', '6214920603338490', '', '试用期：6500；转正：7000', '2017-03-06'),
('郭少秋', '女', '1992-12-02', '黑龙江', '单身', '230826199212021622', '', '15201885357', 'G632866666605', '632866605@qq.com', '大学本科', '机械设计制造及其自动化', '哈尔滨剑桥学院', '', '', '00000665', '上海', '上海总部', '一级部门', '家用事业一部', '三级部门', '', '2017-03-14', '1', '助理', '产品企划', '试用', '派遣合同', '前程无忧', '2017-03-14', '2020-06-30', '招商银行', '', '170584744205', '试用期：5000，转正：5500', '2017-03-14'),
('李鑫源', '男', '1995-01-01', '河南虞城', '单身', '411425199501015110', '', '18237054924', 'yuan00713', 'l_xy1011@163.com', '大学本科', '信息管理与信息系统', '天津大学仁爱学院', '', '', '00000666', '上海', '上海总部', '一级部门', '资讯管理部', '三级部门', '', '2017-03-20', '1', '助理', 'SAP系统分析实习生', '实习', '派遣合同', '前程无忧', '2017-03-20', '2017-06-30', '招商银行', '6214832143451586', '', '', '2017-03-20'),
('何益明', '男', '1995-05-23', '江苏', '单身', '320684199505236410', '', '15722994112', 'hym1995sky', '', '大学专科', '应用电子技术', '无锡科技职业学院', '', '', '00000667', '上海', '上海总部', '一级部门', '品保一部', '三级部门', '', '2017-03-20', '1', '助理', '品保', '试用', '派遣合同', '前程无忧', '2017-03-20', '2020-06-30', '江苏银行', '6228760105003227426', '', '', '2017-03-20'),
('吴松栋', '男', '1994-12-08', '江苏', '单身', '321281199412083216', '', '15152207617', '15152207617', '', '中专', '数控加工', '无锡海鹰技工学校', '', '', '00000668', '上海', '上海总部', '一级部门', '品保一部', '三级部门', '', '2017-03-20', '1', '助理', '品保', '试用', '派遣合同', '前程无忧', '2017-03-20', '2020-06-30', '江苏银行', '6221730101008054552', '', '', '2017-03-20'),
('陈进', '男', '1990-03-06', '安徽省寿县', '单身', '342422199003062890', '上海市', '13817755464', 'ww00115000', '', '大学本科', '国际经济与贸易', '上海交通大学', '', '', '00000671', '上海', '上海总部', '一级部门', '二级部门', '三级部门', NULL, '2017-04-10', '1', '助理', '', '试用', '派遣合同', '前程无忧', '2017-04-04', '2020-06-30', '招商银行', '6226090215530839', '', '', '2017-04-26'),
('薛冰', '女', '1991-01-11', '山东', '单身', '37028419900111082X', '', '13122338223', 'icey9001', 'xuebinggo@sina.com', '硕士', '', '', '东华大学', '', '00000672', '上海', '上海总部', '一级部门', '大数据中心', '三级部门', '', '2017-04-14', '1', '助理', '数据', '试用', '派遣合同', '前程无忧', '2017-04-14', '2020-06-30', '光大银行', '6214920603301654', '163163315', '转正薪资视能力再定', '2017-04-14'),
('陈津津', '女', '1991-11-20', '浙江省乐清市', '单身', '330382199111203627', '上海市', '13957778119', 'chenjinxuan1991', '', '大学本科', '信息管理与信息系统', '陕西师范大学', '', '', '00000673', '上海', '上海总部', '一级部门', '大数据中心', '三级部门', '', '2017-04-24', '1', '助理', 'CRM运营', '转正', '正式合同', '沈阳脱普上海分公司', '2017-04-24', '2020-06-30', '光大银行', '6226630602387663', '090003117657', '', '2017-04-28');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
